[
  {
    "id": "1",
    "name": "Premium Wireless Headphones",
    "description": "Experience exceptional audio quality with our premium wireless headphones featuring active noise cancellation, 30-hour battery life, and premium comfort padding. Perfect for music lovers, professionals, and travelers who demand the best in audio technology.",
    "price": 199.99,
    "image": "https://images.unsplash.com/photo-1505740420928-5e560c06d30e?w=500&h=500&fit=crop",
    "featured": true
  },
  {
    "id": "2",
    "name": "Smart Fitness Watch",
    "description": "Advanced fitness tracking meets smart technology in this comprehensive health companion. Monitor your heart rate, track workouts, receive notifications, and gain valuable health insights with built-in GPS, sleep tracking, and 7-day battery life.",
    "price": 299.99,
    "image": "https://images.unsplash.com/photo-1523275335684-37898b6baf30?w=500&h=500&fit=crop",
    "featured": true
  },
  {
    "id": "3",
    "name": "Wireless Charging Pad",
    "description": "Simplify your charging routine with this sleek wireless charging pad supporting fast charging for all Qi-enabled devices. Features LED indicators, overcharge protection, and a premium aluminum design that complements any workspace or bedside table.",
    "price": 49.99,
    "image": "https://images.unsplash.com/photo-1586953208448-b95a79798f07?w=500&h=500&fit=crop",
    "featured": false
  },
  {
    "id": "4",
    "name": "Portable Bluetooth Speaker",
    "description": "Powerful 360-degree sound in a compact, waterproof design perfect for any adventure. With 12-hour battery life, IPX7 water resistance, and crystal-clear audio quality, this speaker delivers premium sound wherever life takes you.",
    "price": 89.99,
    "image": "https://images.unsplash.com/photo-1608043152269-423dbba4e7e1?w=500&h=500&fit=crop",
    "featured": true
  },
  {
    "id": "5",
    "name": "USB-C Multiport Hub",
    "description": "Expand your connectivity with this versatile USB-C hub featuring 4K HDMI output, multiple USB 3.0 ports, SD card reader, and fast charging pass-through. The perfect companion for laptops, tablets, and modern devices requiring multiple connections.",
    "price": 79.99,
    "image": "https://images.unsplash.com/photo-1625842268584-8f3296236761?w=500&h=500&fit=crop",
    "featured": false
  }
]
